{
  "personal_data": {
    "name": "Tejas Gathekar",
    "social_links": {
      "linkedin": "https://www.linkedin.com/in/tejas-gathekar/",
      "github": "https://github.com/TejasG-007",
      "instagram": "https://www.instagram.com/tejas.gathekar/",
      "resume": "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/resume/TejasGathekar.pdf"
    },
    "desc_short": "🚀 Experienced in design, integration, and problem-solving, with a passion for launching new projects. 📱 Skilled in **Flutter (3.5+ years)**, **Kotlin Multiplatform**, and **SwiftUI**, I specialize in building **intuitive, high-performance mobile apps**. ⚡ Proficient in **RESTful API integration**, third-party libraries, and performance optimization to enhance user experience. 🎯",
    "desc": [
      "🚀 Strong in design and integration with intuitive problem-solving skills. Passionate about implementing and launching new projects. 💡 Skilled at translating business requirements into scalable solutions. Seeking opportunities to contribute as a software engineer in a tech-driven firm.",
      "📱 I'm a seasoned **mobile app developer** with **3.5+ years of experience**, specializing in **Flutter, Kotlin Multiplatform (KMP), and SwiftUI**. I excel at building high-performance cross-platform applications, seamlessly integrating **RESTful APIs**, third-party libraries, and optimizing app performance to deliver exceptional user experiences. 🔥 Adaptable to evolving technologies, I thrive on creating intuitive and scalable solutions."
    ]
  },
  "experience": [
    {
      "name": "Accenture Pvt Ltd",
      "from": "sep-2021",
      "to": "present",
      "desc": [
        "Designed and developed user-friendly mobile applications using Flutter and Dart for Android platforms.",
        "Collaborated with cross-functional teams including designers, project managers, and quality assurance engineers to ensure timely delivery of high-quality applications.",
        "Implemented RESTful APIs to retrieve and update data from the backend server and Integrated Firebase and SQLite for data storage, authentication, and push notifications.",
        "Utilized GetX and Provider for state management and efficient code reusability Implemented Material Design and responsive UI/UX design for better user experience.",
        "Optimized app performance by identifying and resolving issues related to memory leaks and app crashes Followed Agile methodologies for project management and version control using Git and Github."
      ]
    },
    {
      "name": "Vensark Tech. Nanded",
      "from": "07-2020",
      "to": "08-2021",
      "desc": [
        "Developed and maintained the corporate website and Android application using WordPress and Flutter SDK.",
        "Utilized Firebase for backend and push notification services for mobile applications. Followed best practices for Flutter, React, and WordPress development including component-based architecture, state management, and debugging.",
        "Worked closely with clients to understand their requirements and provide effective solutions."
      ]
    }
  ],
 "project_data": [
    {
      "name": "ERP APP (Responsive)",
      "desc": "Developed and launched an exclusive ERP (Enterprise Resource Planning) application tailored for educational institutions, allowing teachers to efficiently manage student records and assignments.\nThis resulted in improved administrative processes and the ability to generate detailed reports in PDF format.\nThe system has streamlined teacher data entry and task assignment processes, providing authorities with real-time updates on task completion.\nThis ERP application is accessible via both web and Android mobile app platforms, enhancing accessibility and convenience for all users within the organization.\n\nusername:admin@admin.com\npassword:admin@1",
      "desc_short": "A responsive ERP system for educational institutions to manage student records, assignments, and generate reports, available on web and Android.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/erp_app.png"
      ],
      "web_link": "https://tejasg-007.github.io/EPR-system-mgmt.github.io/#/",
      "git_link": "https://github.com/TejasG-007/EPR-system-mgmt.github.io"
    },
    {
      "name": "SMPO APP",
      "desc": "Developed and launched an exclusive social media platform for organization/institution members, resulting in a 40% increase in user engagement and fostering a sense of community among students and staff.\nPeople can share media (pictures, text) and others can have the opportunity to comment on and respond to them.\nThe superior authorities (teachers) may assign a task to the student at the end, state of completion notified to the authorities.\nIt's available on the web and the Android mobile app.",
      "desc_short": "A social media platform for institutions, enabling members to share content, interact, and receive task assignments from authorities.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/SMPO.png"
      ],
      "web_link": "https://tejasg-007.github.io/SocialMEdiaApp.github.io/#/",
      "git_link": "https://github.com/TejasG-007/SocialMEdiaApp.github.io.git"
    },
    {
      "name": "TODO APP",
      "desc": "Crafted with Flutter for Android and powered by Firebase, our innovative Todo app delivers efficient task management and organization...",
      "desc_short": "A Flutter-based Todo app with Firebase integration for real-time sync, task tracking, and reminders across devices.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/todo.png"
      ],
      "web_link": "",
      "git_link": "https://github.com/TejasG-007/Todo-App.git"
    },
    {
      "name": "SHAKUNTAL SCHOOL WORDPRESS",
      "desc": "I designed and developed the website for Shankuntal School using WordPress, showcasing my proficiency in web development...",
      "desc_short": "A WordPress-based website for Shakuntal School, designed for an engaging user experience and efficient content management.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/school.JPG"
      ],
      "web_link": "https://shakuntalschool.com/",
      "git_link": ""
    },
    {
      "name": "IT-PLANET WORDPRESS",
      "desc": "During my internship at Vensark Tech in Nanded, I successfully developed an E-Commerce website named IT-World Shop using WordPress...",
      "desc_short": "An e-commerce platform built with WordPress and WooCommerce, featuring product listings, secure payments, and order management.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/itplanet.JPG"
      ],
      "web_link": "https://https://itplanet.shop/",
      "git_link": ""
    },
    {
      "name": "PORTFOLIO FLUTTER",
      "desc": "I developed a responsive portfolio website using the Flutter framework, highlighting my proficiency in web development...",
      "desc_short": "A Flutter-based responsive portfolio website with theme customization options.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/flutterportfolio.PNG"
      ],
      "web_link": "https://tejasg-007.github.io/tejasg.flutter.github.io/",
      "git_link": ""
    },
    {
      "name": "QUOTES APP",
      "desc": "I created a mobile application using the Flutter framework that features an assortment of insightful quotes...",
      "desc_short": "A Flutter-based quotes app showcasing inspiring quotes from great minds.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/quotes.jpg"
      ],
      "web_link": "https://play.google.com/store/apps/details?id=com.mateg.shayari",
      "git_link": ""
    },
    {
      "name": "MEDG APP",
      "desc": "Designed and developed the MedG Android App, especially for people who stay away from home...",
      "desc_short": "A health monitoring app that alerts close contacts when the user experiences health issues.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/banner.jpg"
      ],
      "web_link": "",
      "git_link": "https://github.com/TejasG-007/MedG-byt.git"
    },
    {
      "name": "IOT APP",
      "desc": "Designed and developed a smart Android app that lets users reserve parking spots from anywhere...",
      "desc_short": "A smart parking reservation app providing real-time slot availability and automated fee calculations.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/iot5.png"
      ],
      "web_link": "",
      "git_link": "https://github.com/TejasG-007/IOTmobile"
    },
    {
      "name": "WEATHER APP",
      "desc": "Explore the simplicity of our new Android weather app. Seamlessly combining real-time temperature updates...",
      "desc_short": "A simple Android weather app displaying real-time temperature updates for various cities.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/weather5.png"
      ],
      "web_link": "",
      "git_link": "https://github.com/TejasG-007/book-and-Weather-/tree/weather"
    },
    {
      "name": "User Monthly Progress Web-App",
      "desc": "Track your monthly goals effortlessly with our intuitive Monthly Progress Report Web App developed in Flutter...",
      "desc_short": "A Flutter-based web app for tracking monthly goals with interactive charts and reports.",
      "images": [
        "https://raw.githubusercontent.com/TejasG-007/ProjectData/main/images/userP1.png"
      ],
      "web_link": "https://tejasg-007.github.io/zEEhubAssesment.github.io/",
      "git_link": "https://github.com/TejasG-007/zEEhubAssesment.github.io"
    }
  ]
,
  "site_data": {
    "copyright": "copyright@2025 TejasG"
  }
}
